# GNU userland.
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "diffutils"
brew "inetutils"
brew "gnutls"
brew "gawk"
brew "gnu-tar"
brew "gzip"
brew "make"
brew "gnu-which"
brew "man-db"
brew "autoconf"
brew "bash"
brew "bash-completion@2"
brew "zsh"
brew "zinit"

# Fonts.
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-dejavu"
tap "pedh/monaco-nerd-fonts", trusted: true
cask "font-monaco-nerd-font"

# Essential applications.
cask "iterm2"
cask "google-chrome"
cask "arc"
cask "warp"
cask "mos"
cask "beyond-compare"
cask "raycast"
cask "stats"
cask "betterdisplay"

# Editors.
tap "d12frosted/emacs-plus", trusted: true
cask "emacs-plus-app"
brew "neovim"
cask "cursor"

# Security.
cask "keepassxc"
brew "pass"

# Network tools.
brew "wget"
brew "curl"
brew "httpie"
brew "aria2"
brew "tcpdump"
brew "iperf3"
brew "mtr"
brew "net-snmp"
brew "nexttrace"
brew "ipinfo-cli"
brew "bandwhich"
brew "grpcurl"
brew "websocat"
brew "nginx"
brew "oha"

# Modern macOS tools.
brew "vim"
brew "grep"
brew "openssh"
brew "screen"

# Homebrew.
tap "domt4/autoupdate", trusted: true

# Documents and diagrams.
brew "d2"
brew "graphviz"
brew "plantuml"
brew "mermaid-cli"
cask "drawio"
brew "pandoc"
brew "hugo"
tap "pluk-inc/tap", trusted: true
cask "pluk-inc/tap/markdown-preview"

# CLI navigation, search, and inspection.
brew "zoxide"
brew "atuin"
brew "bat"
brew "fd"
brew "fzf"
brew "eza"
brew "agg"
brew "asciinema"
brew "mas"
brew "htop"
brew "btop"
brew "pstree"
brew "procs"
brew "tlrc"
brew "magic-wormhole"
brew "ripgrep"
brew "ast-grep"
brew "lsusb"
brew "argon2"
brew "shellcheck"
brew "jq"
brew "yq"
brew "pngpaste"
brew "duckdb"
brew "cloc"
brew "m-cli"
brew "diskonaut"
brew "dust"
brew "fblog"
brew "autossh"
brew "hwloc"
brew "rpm"
brew "sysdig"
brew "witr"
brew "terminal-notifier"
brew "lynx"
brew "pv"
brew "tree"
brew "gdu"
brew "zizmor"

# Mail, writing, and spelling.
brew "mu"
brew "isync"
brew "cspell"
brew "languagetool"

# Git and source control.
brew "git"
brew "git-lfs"
brew "git-extras"
brew "git-crypt"
brew "git-delta"
brew "git-flow-next"
brew "gitup"
brew "gitlint"
brew "gh"
brew "lazygit"

# Data, media, and archive processing.
brew "exiv2"
brew "ffmpegthumbnailer"
brew "gs"
brew "imagemagick"
brew "mycli"
brew "pgcli"
brew "lzip"
brew "media-info"
brew "p7zip"
brew "pigz"
brew "poppler"
brew "rename"
brew "yt-dlp"

# Shell and terminal helpers.
brew "rlwrap"
brew "ssh-copy-id"
brew "tmux"

# Build and native toolchain.
brew "cmake"
brew "llvm"
brew "lld"
brew "bear"
brew "meson"
brew "flamegraph"
tap "mysticlgbt/made", trusted: true
brew "mysticlgbt/made/mac-linux-kdk"
brew "editorconfig"
brew "smartmontools"

# Python.
brew "python"
brew "uv"
brew "ruff"

# Go.
brew "go"
brew "buf"
brew "delve"
brew "gofumpt"
brew "goimports"
brew "golines"
brew "gopls"
brew "golangci-lint"
brew "gomodifytags"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "staticcheck"

# Languages and language servers.
brew "deno"
brew "rustup"
brew "npm"
brew "pnpm"
brew "yaml-language-server"
brew "bash-language-server"
brew "shfmt"
brew "terraform-ls"
brew "markdownlint-cli2"

# Kubernetes.
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "helm"
brew "kubebuilder"
brew "k9s"

# GnuPG for PGP-signing commits.
brew "gnupg"
brew "pinentry-mac"

# Cloud computing.
brew "awscli"
brew "azure-cli"
cask "gcloud-cli"
brew "aliyun-cli"
brew "cloudflared"

# AI tools.
cask "claude"
cask "claude-code@latest"
cask "codex"
cask "codex-app"
brew "agent-browser"
tap "steipete/tap", trusted: true
brew "steipete/tap/mcporter"
brew "summarize"
brew "steipete/tap/remindctl"
tap "openclaw/tap", trusted: true
brew "openclaw/tap/gogcli"
tap "antoniorodr/memo", trusted: true
brew "antoniorodr/memo/memo"
cask "cc-pocket"
