# GNU userland.
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "diffutils"
brew "gawk"
brew "gnu-tar"
brew "grep"

# Shell runtimes.
brew "bash"
brew "bash-completion@2"
brew "zsh"

# Shell plugin manager.
brew "zinit"

# Nerd fonts.
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
tap "pedh/monaco-nerd-fonts", trusted: true
cask "font-monaco-nerd-font"

# Regular fonts.
cask "font-dejavu"

# Terminal applications.
cask "iterm2"
cask "warp"

# Browsers.
cask "google-chrome"
cask "arc"

# Input and launcher utilities.
cask "mos"
cask "raycast"

# Display utilities.
cask "betterdisplay"

# Productivity applications.
cask "beyond-compare"

# System monitors.
cask "stats"

# Emacs.
tap "d12frosted/emacs-plus", trusted: true
cask "emacs-plus-app"

# Terminal editors.
brew "vim"
brew "neovim"

# AI editor applications.
cask "cursor"

# Secrets and credentials.
cask "keepassxc"
brew "pass"
brew "argon2"

# Download and HTTP clients.
brew "wget"
brew "curl"
brew "httpie"

# TLS and network libraries.
brew "gnutls"

# Network diagnostics.
brew "mtr"
brew "net-snmp"
brew "nexttrace"
brew "ipinfo-cli"

# API and socket clients.
brew "grpcurl"
brew "websocat"

# Remote access and sessions.
brew "ssh-copy-id"
brew "openssh"
brew "screen"

# macOS integration.
brew "terminal-notifier"

# Package management.
brew "mas"

# Diagramming tools.
brew "d2"
brew "graphviz"
brew "plantuml"
brew "mermaid-cli"
cask "drawio"

# Document conversion and publishing.
brew "pandoc"
brew "hugo"
tap "pluk-inc/tap", trusted: true
cask "pluk-inc/tap/markdown-preview"

# PDF and image document tooling.
brew "ghostscript"
brew "poppler"

# Shell history, navigation, and environment.
brew "zoxide"
brew "atuin"
brew "fzf"
brew "direnv"

# Search and file discovery.
brew "fd"
brew "ripgrep"

# File listing and viewers.
brew "bat"
brew "eza"
brew "tree"

# Structured data tools.
brew "jq"
brew "yq"

# Process inspection.
brew "htop"
brew "btop"
brew "pstree"
brew "procs"
brew "gops"

# Disk usage tools.
brew "dust"

# Structural code search and rewrite.
brew "ast-grep"

# Shell linting.
brew "shellcheck"

# CI and repository linting.
brew "zizmor"

# Markdown linting.
brew "markdownlint-cli2"

# Hardware and system diagnostics.
brew "lsusb"
brew "hwloc"
brew "smartmontools"

# Writing and spelling.
brew "cspell"

# Database tools.
brew "duckdb"

# Git core.
brew "git"
brew "git-lfs"

# Git workflow helpers.
brew "git-extras"
brew "git-delta"
brew "gh"
brew "lazygit"

# Git security and policy.
brew "git-crypt"
brew "gitlint"

# Image processing and clipboard capture.
brew "imagemagick"
brew "pngpaste"

# Archive and compression tools.
brew "gzip"
brew "lzip"
brew "p7zip"
brew "pigz"
brew "xz"

# File renaming tools.
brew "rename"

# Shell help and command helpers.
brew "tlrc"
brew "pv"

# Terminal multiplexing.
brew "tmux"

# Build systems.
brew "make"
brew "cmake"
brew "meson"

# Native toolchain.
brew "autoconf"
brew "llvm"
brew "lld"

# Python runtime and package tools.
brew "python"
brew "uv"

# Python linting and formatting.
brew "ruff"

# Go runtime.
brew "go"

# Go debugging and editor support.
brew "delve"
brew "gopls"

# Go formatting and imports.
brew "gofumpt"
brew "goimports"

# Go linting.
brew "golangci-lint"
brew "staticcheck"

# Protocol buffers.
brew "protobuf"
brew "buf"

# Protocol buffer Go plugins.
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"

# JavaScript tooling.
brew "node"
brew "pnpm"

# Language servers.
brew "yaml-language-server"
brew "bash-language-server"

# Formatters and editor config.
brew "shfmt"
brew "editorconfig"

# Kubernetes core CLI.
brew "kubernetes-cli"
brew "krew"

# Kubernetes context and package tools.
brew "kubectx"
brew "helm"

# Kubernetes terminal UI.
brew "k9s"

# GnuPG for PGP-signing commits.
brew "gnupg"
brew "pinentry-mac"

# AI CLI applications.
cask "codex"

# AI support tools.
brew "agent-browser"
