# Install GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
# Install some other useful utilities like `sponge`.
brew "moreutils"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
# Install GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed"
# Some more GNU utils.
brew "diffutils"
brew "inetutils"
brew "gnutls"
brew "gawk"
brew "gnu-tar"
brew "gzip"
brew "make"
brew "wdiff"
brew "gnu-indent"
brew "gnu-which"
brew "man-db"
# Install a modern version of Bash.
brew "bash"
brew "bash-completion@2"

# Install fonts.
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-dejavu"
tap "pedh/monaco-nerd-fonts"
cask "font-monaco-nerd-font"

# Install zsh and zinit.
brew "zsh"
brew "zinit"

# Install essential applications.
cask "iterm2"
cask "google-chrome"
cask "arc"
cask "warp"

# Editors.
tap "d12frosted/emacs-plus"
cask "emacs-plus-app"
brew "neovim"
cask "antigravity"

# Awesome MacOS applications.
cask "mos"
cask "jordanbaird-ice"
cask "free-download-manager"
cask "beyond-compare"
cask "raycast"
cask "stats"
cask "flux-app"
cask "betterdisplay"
cask "xquartz"
cask "pearcleaner"
cask "onyx"

# Security.
cask "keepassxc"
brew "pass"

# Install network tools.
brew "wget"
cask "charles"
cask "wireshark-app"
cask "postman"
brew "httpie"
brew "aria2"
brew "tcpdump"
brew "iperf3"
brew "proxychains-ng"
brew "mtr"
brew "nexttrace"
brew "ipinfo-cli"
brew "grpcurl"
brew "bandwhich"
brew "netdata"
brew "oha"

# Install more recent versions of some macOS tools.
brew "vim"
brew "grep"
brew "openssh"
brew "screen"
brew "php"
brew "gmp"

# Homebrew.
tap "homebrew/command-not-found"
tap "domt4/autoupdate"

# Document tools.
brew "graphviz"
brew "plantuml"
cask "calibre"
cask "mactex"
cask "inkscape"
cask "logseq"
cask "xournal++"
cask "zotero"
brew "pandoc"
brew "hugo"

# Awesome command line tools.
brew "autojump"
brew "bat"
brew "fd"
brew "fzf"
brew "lsd"
brew "asciinema"
brew "htop"
brew "gotop"
brew "btop"
brew "bottom"
brew "pstree"
brew "procs"
brew "tlrc"
brew "magic-wormhole"
brew "mycli"
brew "mas"
brew "pgcli"
brew "the_silver_searcher"
brew "ripgrep"
brew "lsusb"
brew "thefuck"
brew "shellcheck"
brew "jq"
brew "yq"
brew "duckdb"
brew "cloc"
brew "mu"
brew "isync"
brew "m-cli"
brew "diskonaut"
brew "dust"
brew "fblog"
brew "ispell"
brew "autossh"
brew "hwloc"
brew "rpm"
brew "sysdig"
brew "witr"

# Install other useful binaries.
brew "ack"
brew "exiv2"
brew "ffmpegthumbnailer"
brew "git"
brew "git-lfs"
brew "git-extras"
brew "git-delta"
brew "git-flow"
brew "gitup"
brew "gitui"
brew "gitlint"
brew "gh"
brew "global"
brew "gs"
brew "imagemagick"
brew "lua"
brew "lynx"
brew "lzip"
brew "media-info"
brew "p7zip"
brew "pigz"
brew "poppler"
brew "pv"
brew "rename"
brew "rlwrap"
brew "ssh-copy-id"
brew "tree"
brew "vbindiff"
brew "zopfli"
brew "tmux"
cask "cmake-app"
brew "llvm", link: :force
brew "lld"
brew "bear"
brew "meson"
brew "mysticlgbt/made/mac-linux-kdk"
brew "editorconfig"
brew "languagetool"
brew "smartmontools"
brew "lazygit"
brew "gdu"

# Python packages.
brew "python"
brew "ipython"
brew "ansible"
brew "python-lsp-server"
brew "pyenv"
brew "poetry"
brew "pipenv"
brew "uv"

# Golang packages.
brew "go"
brew "golangci-lint"
brew "protobuf"
brew "gops"

# Various programming languages.
brew "rustup"
brew "rust-analyzer"
brew "ghcup"
brew "sbcl"
brew "guile"
brew "npm"
brew "stylelint"
brew "yaml-language-server"
brew "bash-language-server"
brew "shfmt"
brew "terraform-ls"

# Cross compiling.
tap "messense/macos-cross-toolchains"
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu"
brew "messense/macos-cross-toolchains/aarch64-unknown-linux-gnu"

# Kubernetes cli packages.
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "helm"
brew "kubebuilder"
brew "k9s"

# Install GnuPG to enable PGP-signing commits.
brew "gnupg"
cask "gpg-suite"
brew "pinentry-mac"

# Install some CTF tools; see https://github.com/ctfs/write-ups.
brew "aircrack-ng"
brew "bfg"
brew "binutils"
brew "binwalk"
brew "cifer"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "foremost"
brew "hydra"
brew "john"
brew "knock"
brew "netpbm"
brew "nmap"
brew "pngcheck"
brew "socat"
brew "sqlmap"
brew "tcpflow"
brew "tcpreplay"
brew "ucspi-tcp" # `tcpserver` etc.
brew "xz"
brew "radare2"
cask "cutter"
brew "flamegraph"
brew "pngpaste"

# Install font tools.
tap "bramstein/webfonttools"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"

# Multimedia.
cask "kodi"
cask "krita"
cask "wacom-tablet"
cask "listen1"
cask "transmission"

# Language tools.
cask "squirrel-app"

# Cloud computing.
brew "awscli"
brew "azure-cli"
cask "gcloud-cli"
brew "aliyun-cli"
brew "cloudflared"

# AI tools.
cask "claude"
cask "claude-code"
cask "ollama-app"
brew "gemini-cli"

