# Personal GUI applications.
cask "thaw@beta"
cask "wetype"
brew "mole"
tap "caezium/tap", trusted: true
cask "caezium/tap/burrow"

# Documents, knowledge management, and graphics.
cask "calibre"
cask "excalidrawz"
cask "xquartz"
cask "inkscape"
cask "logseq"
cask "zotero"
brew "manim"

# Network GUI and observability tools.
cask "charles"
cask "wireshark-app"
cask "postman"

# GPG GUI.
cask "gpg-suite"

# Personal language ecosystems.
brew "ansible"
brew "gops"
brew "ghcup"
brew "sbcl"
brew "guile"
brew "elan-init"

# Personal cloud and workspace tools.
brew "googleworkspace-cli"

# Font tools.
brew "woff2"

# Multimedia, hardware, and input methods.
cask "krita"
cask "wacom-tablet"
cask "logitech-g-hub"
cask "nvidia-nsight-systems"

# Mac App Store.
mas "Keynote", id: 409183694
mas "The Unarchiver", id: 425424353
mas "Windows App", id: 1295203466

# VSCode and Cursor extensions.
vscode "13xforever.language-x86-64-assembly"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "jebbs.plantuml"
vscode "leanprover.lean4"
vscode "lextudio.restructuredtext"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "matklad.pale-fire"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "qwenlm.qwen-code-vscode-ide-companion"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tuttieee.emacs-mcx"
vscode "ultram4rine.vscode-choosealicense"
vscode "vadimcn.vscode-lldb"
vscode "zxh404.vscode-proto3"

# Go tools.
go "k8s.io/code-generator/cmd/applyconfiguration-gen"
go "k8s.io/code-generator/cmd/client-gen"
go "github.com/containernetworking/cni/cnitool"
go "sigs.k8s.io/controller-tools/cmd/controller-gen"
go "k8s.io/code-generator/cmd/deepcopy-gen"
go "k8s.io/code-generator/cmd/defaulter-gen"
go "sigs.k8s.io/controller-tools/cmd/helpgen"
go "k8s.io/code-generator/cmd/informer-gen"
go "k8s.io/code-generator/cmd/lister-gen"
go "go.uber.org/mock/mockgen"
go "sigs.k8s.io/controller-runtime/tools/setup-envtest"
go "sigs.k8s.io/controller-tools/cmd/type-scaffold"

# uv tools.
uv "maxc-cli"
uv "maxcompute-semantic"
uv "skill-seekers"

# Krew plugins.
krew "access-matrix"
krew "blame"
krew "capture"
krew "cert-manager"
krew "confirm"
krew "cost"
krew "deprecations"
krew "edit-status"
krew "explore"
krew "fuzzy"
krew "gadget"
krew "get-all"
krew "graph"
krew "ice"
krew "images"
krew "kc"
krew "konfig"
krew "kor"
krew "krew"
krew "kruise"
krew "ktop"
krew "lineage"
krew "modify-secret"
krew "neat"
krew "node-shell"
krew "outdated"
krew "pexec"
krew "preflight"
krew "pv-migrate"
krew "ray"
krew "rbac-lookup"
krew "rbac-tool"
krew "resource-capacity"
krew "rolesum"
krew "score"
krew "slice"
krew "sniff"
krew "status"
krew "stern"
krew "support-bundle"
krew "tail"
krew "tmux-exec"
krew "tree"
krew "view-allocations"
krew "view-secret"

# Global npm packages.
npm "@ccpocket/bridge"
