# Security, reverse engineering, and advanced network diagnostics.
brew "acme.sh"
brew "proxychains-ng"
brew "sshuttle"
brew "autossh"
brew "gost"
brew "stunnel"
brew "doh"
brew "lynx"
brew "oha"
brew "bandwhich"
brew "miniupnpc"
brew "tcpdump"
brew "iperf3"
brew "sysdig"
brew "aircrack-ng"
brew "bfg"
brew "binutils"
brew "binwalk"
brew "inetutils"
brew "rpm"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "foremost"
brew "hydra"
brew "john"
brew "knock"
brew "netpbm"
brew "nmap"
brew "pngcheck"
brew "socat"
brew "sqlmap"
brew "tcpflow"
brew "tcpreplay"
brew "ucspi-tcp" # `tcpserver` etc.
brew "radare2"
cask "cutter"

# Cross compiling.
tap "messense/macos-cross-toolchains", trusted: true
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu"
brew "messense/macos-cross-toolchains/aarch64-unknown-linux-gnu"
