# Menu bar management.
cask "thaw@beta"

# Input methods.
cask "wetype"

# System maintenance.
brew "mole"
tap "caezium/tap", trusted: true
cask "caezium/tap/burrow"

# AI CLI applications.
cask "claude-code@latest"

# AI desktop applications.
cask "claude"
cask "codex-app"

# Agent support tools.
brew "summarize"
tap "steipete/tap", trusted: true
brew "steipete/tap/mcporter"

# Terminal recording and demos.
brew "asciinema"
brew "agg"

# Reading and reference management.
cask "calibre"
cask "zotero"

# Knowledge management.
cask "logseq"

# Writing assistance.
brew "languagetool"

# Mail.
brew "mu"
brew "isync"

# Diagram and drawing applications.
cask "excalidrawz"
cask "inkscape"

# Animation and math visualization.
brew "manim"

# Compatibility layers.
cask "xquartz"

# Network analysis GUIs.
cask "charles"
cask "wireshark-app"

# API development GUIs.
cask "postman"

# File transfer tools.
brew "aria2"
brew "magic-wormhole"

# GPG GUI.
cask "gpg-suite"

# Language toolchains.
brew "ghcup"
brew "elan-init"
brew "rustup"

# Language runtimes.
brew "sbcl"
brew "guile"
brew "deno"

# REPL helpers.
brew "rlwrap"

# Go editing helpers.
brew "golines"
brew "gomodifytags"

# Git and repository workflow.
brew "gitup"
brew "fblog"

# Profiling and trace visualization.
brew "flamegraph"
brew "witr"

# Disk usage tools.
brew "diskonaut"
brew "gdu"

# Codebase metrics.
brew "cloc"

# Database clients.
brew "mycli"
brew "pgcli"

# Cloud provider CLIs.
brew "awscli"
brew "azure-cli"
cask "gcloud-cli"
brew "aliyun-cli"

# Cloudflare tooling.
brew "cloudflared"

# Workspace automation.
brew "googleworkspace-cli"

# Personal reminder and memo tools.
brew "steipete/tap/remindctl"
tap "antoniorodr/memo", trusted: true
brew "antoniorodr/memo/memo"

# Internal and private tools.
tap "openclaw/tap", trusted: true
brew "openclaw/tap/gogcli"

# Infrastructure as code.
brew "ansible"
brew "opentofu"
brew "tofu-ls"

# Container runtimes.
brew "container"

# Kubernetes development.
brew "kubebuilder"

# Build introspection.
brew "bear"

# Kernel and platform toolchains.
tap "gay-pizza/made", trusted: true
brew "gay-pizza/made/mac-linux-kdk"

# Font tools.
brew "woff2"

# Media applications.
cask "neteasemusic"
cask "krita"

# Creative hardware drivers.
cask "wacom-tablet"
cask "logitech-g-hub"

# GPU profiling tools.
cask "nvidia-nsight-systems"

# Media metadata tools.
brew "exiv2"
brew "media-info"

# Media thumbnail tools.
brew "ffmpegthumbnailer"

# Media download tools.
brew "yt-dlp"

# Mac App Store.
mas "Keynote", id: 409183694
mas "The Unarchiver", id: 425424353
mas "Windows App", id: 1295203466

# VSCode and Cursor extensions.
vscode "13xforever.language-x86-64-assembly"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "OpenTofu.vscode-opentofu"
vscode "hediet.vscode-drawio"
vscode "jebbs.plantuml"
vscode "leanprover.lean4"
vscode "lextudio.restructuredtext"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "matklad.pale-fire"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tuttieee.emacs-mcx"
vscode "ultram4rine.vscode-choosealicense"
vscode "vadimcn.vscode-lldb"
vscode "zxh404.vscode-proto3"

# Coverage tools.
go "github.com/boumenot/gocover-cobertura"

# Kubernetes code generators.
go "k8s.io/code-generator/cmd/applyconfiguration-gen"
go "k8s.io/code-generator/cmd/client-gen"
go "k8s.io/code-generator/cmd/deepcopy-gen"
go "k8s.io/code-generator/cmd/defaulter-gen"
go "k8s.io/code-generator/cmd/informer-gen"
go "k8s.io/code-generator/cmd/lister-gen"

# Controller tooling.
go "sigs.k8s.io/controller-tools/cmd/controller-gen"
go "sigs.k8s.io/controller-tools/cmd/helpgen"
go "sigs.k8s.io/controller-tools/cmd/type-scaffold"
go "sigs.k8s.io/controller-runtime/tools/setup-envtest"

# CNI utilities.
go "github.com/containernetworking/cni/cnitool"

# Test and mock tools.
go "go.uber.org/mock/mockgen"

# Python coverage tools.
uv "diff-cover"

# Work Python tools.
uv "maxc-cli"
uv "maxcompute-semantic"
uv "skill-seekers"

# Krew plugins.
krew "access-matrix"
krew "blame"
krew "capture"
krew "cert-manager"
krew "confirm"
krew "cost"
krew "deprecations"
krew "edit-status"
krew "explore"
krew "fuzzy"
krew "gadget"
krew "get-all"
krew "graph"
krew "ice"
krew "images"
krew "kc"
krew "konfig"
krew "kor"
krew "krew"
krew "kruise"
krew "ktop"
krew "lineage"
krew "modify-secret"
krew "neat"
krew "node-shell"
krew "outdated"
krew "pexec"
krew "preflight"
krew "pv-migrate"
krew "ray"
krew "rbac-lookup"
krew "rbac-tool"
krew "resource-capacity"
krew "rolesum"
krew "score"
krew "slice"
krew "sniff"
krew "status"
krew "stern"
krew "support-bundle"
krew "tail"
krew "tmux-exec"
krew "tree"
krew "view-allocations"
krew "view-secret"

# Remote agent clients.
cask "cc-pocket"
npm "@ccpocket/bridge"
